//四資工二甲 41343124 張豈睿 

/*
老實說他這題拆成兩個完全相關的二元數功能完全不懂事來做什麼的
第一題要驗證第二題要單純寫一個函式那幹嘛不合併寫一個就好了
*/

#include <iostream>
#include <cmath> // 數學函式在計算log2(n)時用到
#include <cstdlib> // 一般工具函式 rand()--> 產生隨機數 srand()--> 設定亂數種子
#include <ctime> // 時間函式 time(0)--> 取得現在時間（當亂數種子用）
using namespace std;

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
struct Node { // 定義一個「節點」的結構
    int t; // 節點存的值
    Node* L; // 左子樹
    Node* R; // 右子樹
    Node(int k) : t(k), L(nullptr), R(nullptr) {} // 建立節點並令左右節點為空
};

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Node* FF(Node* root, int t) {
    if (!root) return new Node(t); // 如果目前是空樹建立新節點
    if (t < root->t) // 如果 t 比目前節點小放左邊
        root->L = FF(root->L, t); // 遞迴往左子樹插入
    else
        root->R = FF(root->R, t); // 否則往右子樹
    return root;
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
int HF(Node* root) { // 計算二元數高度
    if (!root) return 0; // 如果為空樹 高度 = 0
    return max(HF(root->L), HF(root->R)) + 1; // height = max(左子樹, 右子樹) + 1 
} // max 函數會挑出兩邊比較大的那個數字

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void DF(Node* root) { // 釋放記憶體
    if (!root) return; // 空節點不用處理
    DF(root->L); // 先刪子節點
    DF(root->R);
    delete root; // 再刪根節點
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void test(int n) { // 測試用的函式
    Node* root = nullptr; // 一開始是空樹

    for (int i = 0; i < n; i++) { // 做 n 次插入
        root = FF(root, rand()); // 插入隨機數
    }

    int h = HF(root); //計算高度
    double r = h / log2(n);

    cout << "n = " << n //印出 n
        << ", height = " << h // 印出高度
        << ", height/log2(n) = " << r << endl; // 印出比值

    DF(root); // 清掉記憶體 很重要 ! !
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
int main() {
    srand(time(0)); // 設定亂數種子且每次執行都不同
    test(100); // 先輸出 100 和 500
    test(500);

    for (int n = 1000; n <= 10000; n += 1000) {// 再從 1000 到 10000  ++1000
        test(n);
    }

    cout << "\n41343124.洋芋 =>防委標記";//此乃防委標記
    return 0;
}